[
  {
    "id": 604,
    "date": "2024-11-18T03:44:16",
    "slug": "a-message-from-evbp",
    "header": "A Message from EVBP",
    "body": "\n<p>Lately, I’ve been reflecting a lot on the future—on where we’re headed and what role I play in it.  The next few years are shaping up to be tough for many of us.  A second Trump term, far-right movements gaining ground globally, climate collapse, wars in the Middle East and Europe… it really feels like the fight between good and evil is playing out in real-time.</p>\n\n\n\n<p>On my <a rel=\"noreferrer noopener\" href=\"https://evbp.bandcamp.com/\" target=\"_blank\">Bandcamp </a>page, there’s a joke I’ve kept for a while: &#8220;<em>Experimental Voice Box Programmer, or EVBP for short, does not make music for a living.  Therefore, you should not give him any of your money.</em>&#8221;  While it’s meant to be tongue-in-cheek, it’s still pretty much true.  I’m humbled when someone spends their hard-earned money on my music, but making a living off of it has never been my intention.  Music, for me, is a joy machine—a way to express myself and connect with others.  That’s the real value.</p>\n\n\n\n<p>With everything going on in the world right now, I’ve decided to make all of my music available on Bandcamp as &#8220;name your price&#8221; downloads for the foreseeable future.  I’ll still charge for physical media to cover material costs and shipping, but digital downloads will be free.  It’s my hope that my music can make someone’s life a little better, even if just for a moment.  And honestly, that’s worth more to me than any amount of money.</p>\n\n\n\n<p>Capitalism has done enough damage in our world, and I want to be as far removed from it as possible.  I know this decision might mean I lose some income, but I’m okay with that.  What I’m not okay with is the grind culture that tells us we must always be selling ourselves, and that our worth is tied to how much money we make.  To that, I say: fuck that.</p>\n\n\n\n<p>If you feel inclined to give back, I’d much rather you donate to a cause that’s doing real, tangible good—like The Trevor Project, Planned Parenthood, Amnesty International, or any other cause that speaks to you.  There are bigger battles being fought out there, and I’m just one person doing my part.  We all need to stand together, especially now.</p>\n\n\n\n<p>The road ahead might be tough, but we’re going to get through this.  Stay strong, take care of each other, and remember that we have the power to create change.  Thank you for being a part of this journey.</p>\n",
    "excerpt": "<p>Lately, I’ve been reflecting a lot on the future—on where we’re headed and what role I play in it. The next few years are shaping up to be tough for many of us. A second Trump term, far-right movements gaining ground globally, climate collapse, wars in the Middle East and Europe… it really feels like &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/news/a-message-from-evbp/\">Continue reading</a></p>\n",
    "metaTags": [10, 24, 23, 8, 22]
  },
  {
    "id": 598,
    "date": "2024-10-04T21:30:29",
    "slug": "new-music-update-are-you-afraid",
    "header": "New Music Update: Are You Afraid?",
    "body": "\n<figure class=\"wp-block-image size-large is-resized\"><img src=\"http://evbpmusic.com/wp-content/uploads/2024/10/are_you_afraid_single_cover_10032024_lower_rez-1024x1024.png\" alt=\"\" class=\"wp-image-600\" width=\"319\" height=\"319\" srcset=\"https://evbpmusic.com/wp-content/uploads/2024/10/are_you_afraid_single_cover_10032024_lower_rez-1024x1024.png 1024w, https://evbpmusic.com/wp-content/uploads/2024/10/are_you_afraid_single_cover_10032024_lower_rez-300x300.png 300w, https://evbpmusic.com/wp-content/uploads/2024/10/are_you_afraid_single_cover_10032024_lower_rez-150x150.png 150w, https://evbpmusic.com/wp-content/uploads/2024/10/are_you_afraid_single_cover_10032024_lower_rez-768x768.png 768w, https://evbpmusic.com/wp-content/uploads/2024/10/are_you_afraid_single_cover_10032024_lower_rez-140x140.png 140w, https://evbpmusic.com/wp-content/uploads/2024/10/are_you_afraid_single_cover_10032024_lower_rez-350x350.png 350w, https://evbpmusic.com/wp-content/uploads/2024/10/are_you_afraid_single_cover_10032024_lower_rez.png 1400w\" sizes=\"(max-width: 319px) 100vw, 319px\" /></figure>\n\n\n\n<p>Just in time for spooky season, is the release of the first single from the upcoming mini-album<em> Only Criminals Get Caught, Pt. I</em> &#8211; &#8220;Are You Afraid?&#8221;</p>\n\n\n\n<p>The song&#8217;s theme deals with how Fox News, and like-minded networks exploit their audiences by playing on the pre-existing fears they may have. <br><br>You can get it over on <a rel=\"noreferrer noopener\" href=\"https://evbp.bandcamp.com/track/are-you-afraid-single-edit\" target=\"_blank\">the bandcamp page</a>, and very soon, at one of the many online music retailors or streaming services.<br><br>Enjoy!</p>\n",
    "excerpt": "<p>Just in time for spooky season, is the release of the first single from the upcoming mini-album Only Criminals Get Caught, Pt. I &#8211; &#8220;Are You Afraid?&#8221; The song&#8217;s theme deals with how Fox News, and like-minded networks exploit their audiences by playing on the pre-existing fears they may have. You can get it over &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2024/10/new-music-update-are-you-afraid/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 595,
    "date": "2023-12-11T22:47:30",
    "slug": "an-exciting-update",
    "header": "An exciting update!",
    "body": "\n<p>The title should tell you all you need to know.  It&#8217;s exciting!<br><br>So it&#8217;s been a minute since I posted any updates.  For the small &#8211; but loyal &#8211; handful of people following my crazy musical journey, I wanted to let you know what has been going on.</p>\n\n\n\n<p>The next album has taken me a longer than I initially expected it to for a handful of reasons.  It has taken so long in fact, that I have decided to split it into two parts. <strong><em> Only Criminals Get Caught,  Part 1</em></strong> will be released in the first half of 2024;  it&#8217;s bookend, <strong><em>Part 2</em></strong> will be released later in the year.<br><br>It is a synthwave record with a lyrical focus on addressing events of recent years &#8211; specifically in relation to societal changes, justice, and environmental concerns.<br><br>I have not decided yet if there will be a physical release.  Possibly a limited run, but nothing like what was done for <em><strong>M.E.O.W.</strong></em> and probably not a cassette release like I did for <strong><em>Faux Pleasure</em></strong>.  Which, by the way, is still available in limited quantities on <a href=\"https://evbp.bandcamp.com/album/faux-pleasure\">bandcamp</a> if you would like some vaporwave flavor in your life!<br><br>Following the release of <strong><em>Part 2</em></strong>, I think I am likely to go away for a while.  I may release more stand-alone tracks instead of albums, but only time will tell.<br><br>Thanks for stopping by and continuing to support my creative endeavors. You rock!</p>\n",
    "excerpt": "<p>The title should tell you all you need to know. It&#8217;s exciting! So it&#8217;s been a minute since I posted any updates. For the small &#8211; but loyal &#8211; handful of people following my crazy musical journey, I wanted to let you know what has been going on. The next album has taken me a &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2023/12/an-exciting-update/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 567,
    "date": "2021-11-02T01:29:21",
    "slug": "has-it-really-been-a-year-since-my-last-major-update",
    "header": "Has it really been a year since my last major update?!",
    "body": "\n<p>Sometimes I consider getting rid of this thing and focusing my attention on making more and better music!</p>\n\n\n\n<p>Thankfully, Tangerine Mussolini has been kicked out of the White House. And while I am no fan of Joe Biden, the only viable alternative was way worse. Anyway, on to what you&#8217;re probably here for &#8211; more and better music!</p>\n\n\n\n<p>Following the release of パラメータの特定のセット, or <em>A Certain Set of Parameters</em> for us Kanj-illiterate, I began work on what was intended to be a synthwave EP. Unfortunately, I caught a bad case of perfectionist syndrome and subsequently shelved it for later. Have no fears, it will see the light of day and I&#8217;m sure you&#8217;re going to love it when it&#8217;s done!</p>\n\n\n\n<figure class=\"alignleft size-large is-resized\"><a href=\"https://evbp.bandcamp.com/album/Faux-Pleasure\"><img src=\"http://evbpmusic.com/wp-content/uploads/2021/11/FauxPleasure-953x1024.png\" alt=\"\" class=\"wp-image-568\" width=\"310\" height=\"333\" srcset=\"https://evbpmusic.com/wp-content/uploads/2021/11/FauxPleasure-953x1024.png 953w, https://evbpmusic.com/wp-content/uploads/2021/11/FauxPleasure-279x300.png 279w, https://evbpmusic.com/wp-content/uploads/2021/11/FauxPleasure-768x825.png 768w, https://evbpmusic.com/wp-content/uploads/2021/11/FauxPleasure.png 1046w\" sizes=\"(max-width: 310px) 100vw, 310px\" /></a><figcaption>Faux Pleasure</figcaption></figure>\n\n\n\n<p>In order to scratch the creative itch, I started working on some more retro ambient pieces. These eventually evolved into what I ended up releasing in the last 48 hours &#8211; <em><strong><a rel=\"noreferrer noopener\" href=\"https://evbp.bandcamp.com/album/Faux-Pleasure\" target=\"_blank\">Faux Pleasure</a></strong></em>! It&#8217;s, let&#8217;s face it &#8211; vaporwave &#8211; but at the same time I realize it doesn&#8217;t follow the formula for vw 100%&#8230; it&#8217;s a little darker. </p>\n\n\n\n<p>As the album evolved, I began to construct a narrative around a person who experiences retail therapy, but because of their addictive personality, shopping just becomes another temporary fix. Until finally, they&#8217;ve fully embraced their loneliness and the fact that they combat their negative feelings by escaping into consumer utopia. </p>\n\n\n\n<p>They  attempt to reconnect with people by going out to public events where they can be part of the crowd without obligation to interact (&#8220;Expectant Nights at the Carnival&#8221;). But eventually they fall back into the pattern of buying things to help fill the emptiness (&#8220;Liquidation&#8221;, &#8220;All the Best Stuff&#8221;, &#8220;Payday&#8221;, etc).</p>\n\n\n\n<p>It&#8217;s not exactly a happy album. Heh. That being said, I&#8217;m very proud of this record and I hope you will take the time to give it a listen. It&#8217;s also on <a rel=\"noreferrer noopener\" href=\"https://www.youtube.com/watch?v=sdORlH6JIV4&amp;list=PLFb63Tg_UXIcbqH4FOpo6mw6d8wwclJz9\" target=\"_blank\">YouTube</a> (including music videos for &#8220;<a href=\"https://www.youtube.com/watch?v=X9sqc9E5i38&amp;t=15s\" target=\"_blank\" rel=\"noreferrer noopener\">The Crane Game</a>&#8221; and &#8220;<a href=\"https://www.youtube.com/watch?v=JtdSbvuyhN0\" target=\"_blank\" rel=\"noreferrer noopener\">We Tried Staying Happy</a>&#8220;) if you prefer to listen to your music that way! </p>\n\n\n\n<p>So what is next on the agenda, you ask? Well I don&#8217;t want to commit to anything I can&#8217;t confidently deliver in a timely manner. But I am presently working on remastering <a rel=\"noreferrer noopener\" href=\"https://experimentalvoiceboxprogrammer.bandcamp.com/album/the-x-of-art-ep\" target=\"_blank\">The X of Art EP</a> and expanding it to include a bunch of tracks that were also released around that time, as well as some that were never released! At this point, it&#8217;s almost a double album. Stay tuned!</p>\n\n\n\n<p>In the meantime, check out Faux Pleasure, and if you are looking for my stuff on Spotify, Pandora, etc you can find A Certain Set of Parameters and M.E.O.W. <a rel=\"noreferrer noopener\" href=\"https://open.spotify.com/artist/6dKaq0vpP3FwK9OYJAfXyS\" target=\"_blank\">here</a>!</p>\n\n\n\n<p>Thanks again for all your support and enthusiasm!<br><br>Much Love and Respect,<br><br>Adam</p>\n",
    "excerpt": "<p>Sometimes I consider getting rid of this thing and focusing my attention on making more and better music! Thankfully, Tangerine Mussolini has been kicked out of the White House. And while I am no fan of Joe Biden, the only viable alternative was way worse. Anyway, on to what you&#8217;re probably here for &#8211; more &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2021/11/has-it-really-been-a-year-since-my-last-major-update/\">Continue reading</a></p>\n",
    "metaTags": [20, 17, 18, 19, 21, 5]
  },
  {
    "id": 557,
    "date": "2020-10-02T03:18:48",
    "slug": "new-world-new-music",
    "header": "New world, new music.",
    "body": "\n<p>2020 has been a hell of a year.</p>\n\n\n\n<p>A pandemic. A recession. An impeached president nearly starting a war with Iran. Over 200,000 Americans dead. Protests and riots. Rampant climate collapse. Allegations that doctors in ICE detention centers have been performing unnecessary hysterectomies on refugees. And that&#8217;s just to name a few things! </p>\n\n\n\n<p>It feels like something out of a dystopian novel. It&#8217;s like <em>1984</em>,  <em>Brave New World</em>, the <em>Hunger Games</em>, and Elie Wiesel&#8217;s <em>Night </em>all rolled into one stress-inducing roller coaster. The state of the world outside my door has not been lost on me, even as I practice social distancing.<br><br><figure><img class=\"wp-image-558\" style=\"margin-right:15px;clear:both;float:left;width: 250px;\" src=\"http://evbpmusic.com/wp-content/uploads/2020/10/evbp_acsop_final_light_version_500x500.png\" alt=\"A Certain Set of Parameters\" srcset=\"https://evbpmusic.com/wp-content/uploads/2020/10/evbp_acsop_final_light_version_500x500.png 500w, https://evbpmusic.com/wp-content/uploads/2020/10/evbp_acsop_final_light_version_500x500-300x300.png 300w, https://evbpmusic.com/wp-content/uploads/2020/10/evbp_acsop_final_light_version_500x500-150x150.png 150w, https://evbpmusic.com/wp-content/uploads/2020/10/evbp_acsop_final_light_version_500x500-140x140.png 140w, https://evbpmusic.com/wp-content/uploads/2020/10/evbp_acsop_final_light_version_500x500-350x350.png 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></figure>And so in this dystopian spirit, I present to you   <strong>パラメータの特定のセット</strong>. For those not fluent in kanji, that is &#8220;A Certain Set of Parameters&#8221; &#8211; A concept record intended to capture the &#8216;end of times&#8217; vibe many of us are experiencing. Lots of different music styles influenced this record &#8211; ambient, industrial, synthwave, vaporwave, and a little bit of The Swans thrown in for good measure.</p>\n\n\n\n<p>It&#8217;s available on Bandcamp at present, and should be available on other digital media outlets within the next few weeks. <br><br>I want to thank all my fans from the bottom of my heart, for your patience and support. Making this record was a cathartic experience. It&#8217;s been a while since I&#8217;ve felt excited about making music, and this feels like the kickstart I needed. So expect more music in the near future!</p>\n\n\n\n<p></p>\n",
    "excerpt": "<p>EVBP returns with a brand new EP!</p>\n",
    "metaTags": [15, 11, 13, 14, 12, 16, 6, 5]
  },
  {
    "id": 548,
    "date": "2020-05-22T00:52:56",
    "slug": "the-world-or-at-least-my-inbox-is-safe-once-again",
    "header": "The World (or at least my inbox) Is Safe Once Again!",
    "body": "\n<figure class=\"wp-block-image\"><img src=\"http://evbpmusic.com/wp-content/uploads/2020/05/1_2020_grayscale.jpg\" alt=\"\"/></figure>\n\n\n\n<p>I finally got rid of the contact form because that A&amp;R guy from Universal Music that I kept sending links to my <a href=\"https://experimentalvoiceboxprogrammer.bandcamp.com\">Bandcamp</a> page wasn&#8217;t picking up what I was putting down. </p>\n\n\n\n<p>Also, I got tired of spammers seeing &#8220;<em>programmer</em>&#8221; in the key words for the sight and assuming that I am a computer programmer. I mean, I am&#8230; but that&#8217;s not the point!</p>\n\n\n\n<p>You can still email me, if you&#8217;re old fashioned like that. Or you can get at me on one of the many social media platforms that I waste time on.</p>\n\n\n\n<p></p>\n\n\n\n<p>Hey, have you guys ever heard of vaporwave, synthwave, or <code>[insert esoteric music genre here]</code>? Because I am totally into <code>[insert esoteric moosic genre here]</code> right now! And I am experimenting with it!<br><br>That&#8217;s right, I am working on music again! This whole Covid-19 thing makes staying at home and working on music in my free time easier. Of course, I&#8217;m still my own worst critic, so that double-LP magnum opus is still a ways away. </p>\n\n\n\n<p>But if you are here, I appreciate your interest and I promise to share some new music with you in the near future. Maybe an EP, maybe just a single, maybe a double-LP magnum opus! Wait, no. Scratch that last one.<br><br>I hope you and yours are staying safe, sane, and healthy. We will get through this. And hopefully unseat King KFC in November!</p>\n\n\n\n<p></p>\n\n\n\n<p>Much love,</p>\n\n\n\n<p>Adam</p>\n",
    "excerpt": "<p>I finally got rid of the contact form because that A&amp;R guy from Universal Music that I kept sending links to my Bandcamp page wasn&#8217;t picking up what I was putting down. Also, I got tired of spammers seeing &#8220;programmer&#8221; in the key words for the sight and assuming that I am a computer programmer. &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2020/05/the-world-or-at-least-my-inbox-is-safe-once-again/\">Continue reading</a></p>\n",
    "metaTags": [10, 7, 9, 8, 6, 5]
  },
  {
    "id": 542,
    "date": "2019-03-26T02:55:22",
    "slug": "a-brief-and-long-overdue-update",
    "header": "A brief (and long overdue) update",
    "body": "\n<p>Greetings and salutations to you, people of the internet!</p>\n\n\n\n<p>It has been quite some time since I have updated this site, and I feel the need to inform my supporters of what I am cooking up. I have provided guitars to my friend <a href=\"https://www.youtube.com/c/ForestRainMedia/\">Forest Rain</a> for her performances at Ponyville Ciderfest &#8217;17 and &#8217;18. I helped out my buddy <a href=\"https://www.youtube.com/user/BBBandNerd\">SteelChords</a> with his parody of Bowling For Soup called &#8220;Sweet Apple Acres&#8221;. And finally, I have spent the last few months working on an MLP-themed album, with the working title <em>How Ponies Play Guitar</em>. A few months ago, I contributed a version of the track &#8220;Sticks &amp; Stones&#8221; to the <a href=\"https://ponyvilleciderfest.com/\">Ponyville Ciderfest 2018</a> charity album. Go check it out <a href=\"https://ponyvilleciderfest.bandcamp.com/releases\">here</a>!</p>\n\n\n\n<p>Now where does this leave the followup to <em>MEOW</em>? Shelved for the time being. It&#8217;s been an ambition of mine to write an entire MLP album for a couple years now, and so I want to do this while the idea is still fresh.</p>\n\n\n\n<p>Also, if it weren&#8217;t painfully obvious, this site is in serious need of a facelift. So in between my day job, writing songs about pastel horses, and re-watching the She-Ra reboot for the 38th time I will be putting a new coat of paint on this rusty old jalopy. It may take some time as I plan to abandon WordPress in favor of something a little more.. customized.</p>\n\n\n\n<p>So that&#8217;s all for now. Stay tuned for new music, festival appearances, etc.</p>\n\n\n\n<p>Stay weird!<br></p>\n\n\n\n<p></p>\n",
    "excerpt": "<p>Greetings and salutations to you, people of the internet! It has been quite some time since I have updated this site, and I feel the need to inform my supporters of what I am cooking up. I have provided guitars to my friend Forest Rain for her performances at Ponyville Ciderfest &#8217;17 and &#8217;18. I &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2019/03/a-brief-and-long-overdue-update/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 527,
    "date": "2016-03-19T01:48:38",
    "slug": "everybodys-a-critic-yay",
    "header": "Everybody&#8217;s a Critic! Yay!",
    "body": "<p>Warm greetings, internet! It&#8217;s been a minute.</p>\n<p><strong>How would you like to earn a signed copy of M.E.O.W. at no cost to you? Of course you would!</strong></p>\n<p>For the first 20 people to post a review of <em>The Mechanical Essence Of Whiskers</em> on <a href=\"https://www.amazon.co.uk/gp/product/B01C72YNXI/ref=dm_ws_sp_ps_dp\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon</a>, <a href=\"https://itunes.apple.com/us/album/mechanical-essence-whiskers/id1087530987\" target=\"_blank\" rel=\"noopener noreferrer\">iTunes</a>, or <a href=\"http://www.cdbaby.com/cd/experimentalvoiceboxprog\" target=\"_blank\" rel=\"noopener noreferrer\">CDBaby</a>, I will send you a signed copy of <em>M.E.O.W.</em> that you can sell on eBay for lots of money (maybe not now, but when I die from a candy overdose in 20 years it will be worth a pretty penny)!</p>\n<p>Head over to <strong><a href=\"https://www.youtube.com/playlist?list=PLFb63Tg_UXIfafJP-tncC8Swx1zkdvNXt\" target=\"_blank\" rel=\"noopener noreferrer\">YouTube</a></strong> to preview the album! When you&#8217;re done, email me at <a href=\"mailto:fanmail@evbpmusic.com\">fanmail@evbpmusic.com</a> with your name &amp; mailing address and BaBOOM! Signed Physical Disc Thingy!</p>\n",
    "excerpt": "<p>Warm greetings, internet! It&#8217;s been a minute. How would you like to earn a signed copy of M.E.O.W. at no cost to you? Of course you would! For the first 20 people to post a review of The Mechanical Essence Of Whiskers on Amazon, iTunes, or CDBaby, I will send you a signed copy of &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2016/03/everybodys-a-critic-yay/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 515,
    "date": "2016-02-24T23:38:29",
    "slug": "the-wait-is-over-meow-is-here",
    "header": "The wait is over. MEOW is here!",
    "body": "<figure><a href=\"http://evbpmusic.com/wp-content/uploads/2016/02/meow_physical1.png\"><img src=\"http://evbpmusic.com/wp-content/uploads/2016/02/meow_physical1-300x267.png\" alt=\"meow_physical\" class=\"alignnone size-medium wp-image-518\" srcset=\"https://evbpmusic.com/wp-content/uploads/2016/02/meow_physical1-300x267.png 300w, https://evbpmusic.com/wp-content/uploads/2016/02/meow_physical1.png 947w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></figure>\n<p>It&#8217;s finally here! After years of planning, mixing, and fussing over details, <em>The Mechanical Essence Of Whiskers</em> is finally back from the pressing plant! $5.00 plus s&amp;h will get you one of these beauties. Or, if you like to buy stuff from <a href=\"http://www.cdbaby.com/cd/experimentalvoiceboxprog\" target=\"_blank\" rel=\"noopener noreferrer\">CDBaby</a>, you can get it there too! It will also be available from iTunes, Rhapsody, etc. in the near future. Keep an eye on my <a href=\"http://twitter.com/_evbp\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter feed</a> &#8211; I&#8217;ll let you know when it&#8217;s available there. As well as Bandcamp. And&#8230; other sites, I&#8217;m sure.</p>\n",
    "excerpt": "<p>It&#8217;s finally here! After years of planning, mixing, and fussing over details, The Mechanical Essence Of Whiskers is finally back from the pressing plant! $5.00 plus s&amp;h will get you one of these beauties. Or, if you like to buy stuff from CDBaby, you can get it there too! It will also be available from &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2016/02/the-wait-is-over-meow-is-here/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 513,
    "date": "2016-02-22T04:15:11",
    "slug": "hurray",
    "header": "Hurray&#8230;?",
    "body": "<p>According to CDBaby, today is the official release date for <em>The Mechanical Essence Of Whiskers</em>. The physicial copies are on their way from Disc Makers, you will soon be able to purchase it on iTunes (and CDBaby, of course) and I still don&#8217;t have a live band!! I&#8217;m a total failure at live banding! Expect another post when the physical copies are in my grubby, little mitts!</p>\n",
    "excerpt": "<p>According to CDBaby, today is the official release date for The Mechanical Essence Of Whiskers. The physicial copies are on their way from Disc Makers, you will soon be able to purchase it on iTunes (and CDBaby, of course) and I still don&#8217;t have a live band!! I&#8217;m a total failure at live banding! Expect &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2016/02/hurray/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 509,
    "date": "2016-01-13T02:35:42",
    "slug": "werent-you-supposed-to-be-releasing-an-album-er-something",
    "header": "Weren&#8217;t you supposed to be releasing an album, er something?",
    "body": "<p>Long time no see, internet fanbase! I wanted to give a brief update here, because I did not want to appear to be a neglectful overlord. I care for all of my minions of weirdness!</p>\n<p>First the good news. I got the mastered copy of the album back, and it sounds awesome!! I definitely think the time spent doing this right was well worth it (even if it did take three times longer than I would have liked). Rest assured you will be able to acquire the awesomeness for yourselves very soon!</p>\n<p>Now the bad news. Western Digital is the devil. The completed artwork for the album (vectors, layered graphics, etc) is gone. I had saved it &#8211; along with a large number of personal files, lyrics, etc. &#8211; on an external WD drive. When I went to acquire these files yesterday to prep them for the duplication plant&#8217;s template, they were nowhere to be found. Which means I now have to start over with the album artwork. So the bad news is that the album release is going to be delayed once again.</p>\n<p>The upside &#8211; because after getting on Twitter yesterday, venting and spewing vitriol at Western Digital I decided that there has to be a positive to this unfortunate event. I decided that the upside would be a revamp of my original design, including contributions from a guest artist. I am presently looking at designers and hope to have something soon!</p>\n<p>So that&#8217;s it for now. Thank you for your enthusiasm and patience. Stay weird!</p>\n",
    "excerpt": "<p>Long time no see, internet fanbase! I wanted to give a brief update here, because I did not want to appear to be a neglectful overlord. I care for all of my minions of weirdness! First the good news. I got the mastered copy of the album back, and it sounds awesome!! I definitely think &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2016/01/werent-you-supposed-to-be-releasing-an-album-er-something/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 506,
    "date": "2015-12-07T03:47:37",
    "slug": "update",
    "header": "Update!",
    "body": "<p>Hey all.</p>\n<p>Just wanted to let you know that the album is being mastered at the moment. I expect to have it back within the week! Once I get it back it from mastering, it&#8217;s off for duplication. I will let you know as soon as I have it back, and who knows? Maybe I&#8217;ll do some kind of special streaming event!</p>\n<p>Can&#8217;t wait to share the finished product. Stay tuned!</p>\n",
    "excerpt": "<p>Hey all. Just wanted to let you know that the album is being mastered at the moment. I expect to have it back within the week! Once I get it back it from mastering, it&#8217;s off for duplication. I will let you know as soon as I have it back, and who knows? Maybe I&#8217;ll &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/12/update/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 484,
    "date": "2015-10-12T03:12:48",
    "slug": "completed-tracks-for-m-e-o-w-part-11-the-end-is-near",
    "header": "Completed tracks for M.E.O.W. part 11 &#8211; The end is near!!!!!!!!!",
    "body": "<p>Hey internet!</p>\n<h2><a href=\"http://evbpmusic.com/wp-content/uploads/2015/10/DJ_STFU_PLZ.mp3\">DJ-STFU-PLZ!!!</a></h2>\n<p>This is it! The final track from <em>The Mechanical Essence Of Whiskers</em>. The one that took me three times longer to finish mixing than any other track on the album. I already gave you some background on the meaning of the track (lazy-ass DJs got me all like..). So I&#8217;m gonna use this post to give a shoutout to the people who helped make this track possible.</p>\n<figure><img src=\"http://evbpmusic.com/wp-content/uploads/2015/10/mompete.jpg\" alt=\"mompete\" width=\"217\" height=\"217\" class=\"alignnone size-full wp-image-485\" style=\"float:left;\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/10/mompete.jpg 217w, https://evbpmusic.com/wp-content/uploads/2015/10/mompete-150x150.jpg 150w, https://evbpmusic.com/wp-content/uploads/2015/10/mompete-140x140.jpg 140w\" sizes=\"(max-width: 217px) 100vw, 217px\" /></figure><p><strong>The opening:</strong> Two people need to be recognized for this. <strong>Peter Bishop</strong> did an awesome job coming up with the backing tracks for the Madonna parody &#8211; as well as adding resonance filters and other plug-ins I don&#8217;t know the names of. Pretty spot-on. And <strong>my mom</strong> (yes, you read that correctly internet. Don&#8217;t even think about making any &#8220;your mom&#8221; jokes!) did some awesome on the singing. <em>Represent!</em></p>\n<figure><img src=\"http://evbpmusic.com/wp-content/uploads/2015/10/jesse-resized-gray-188x300.jpg\" alt=\"jesse resized gray\" width=\"188\" height=\"300\" class=\"alignnone size-medium wp-image-486\" style=\"float:right;\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/10/jesse-resized-gray-188x300.jpg 188w, https://evbpmusic.com/wp-content/uploads/2015/10/jesse-resized-gray.jpg 226w\" sizes=\"(max-width: 188px) 100vw, 188px\" /></figure><p><strong>The solo:</strong> My buddy <strong>Jesus &#8220;Jesse&#8221; Sanchez</strong>, lead singer and guitarist of the band <a href=\"https://www.reverbnation.com/trinebulous\">Tri-Nebulous</a> laid down the bass line (the bass line I had recorded was out of tune &#8211; *groan*), as well as all of the acoustic guitars, both lead &amp; rhythm. And WOW! That breakdown just adds some magic &#8211; a pleasantly creative, and relaxing breather that was sorely needed &#8211; to the track that I couldn&#8217;t have imagined in my wildest dream units. <em>Props!</em></p>\n<figure><img src=\"http://evbpmusic.com/wp-content/uploads/2015/10/jessi-punching-cropped-gray-203x300.jpg\" alt=\"jessi punching cropped gray\" width=\"203\" height=\"300\" class=\"alignnone size-medium wp-image-487\" style=\"float:left;\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/10/jessi-punching-cropped-gray-203x300.jpg 203w, https://evbpmusic.com/wp-content/uploads/2015/10/jessi-punching-cropped-gray.jpg 281w\" sizes=\"(max-width: 203px) 100vw, 203px\" /></figure><p><strong>The voice overs:</strong> Regarding the previously mentioned <a href=\"http://evbpmusic.com/2015/09/heres-a-demo-for-you/\">Ke$ha samples</a>, I got something wwaaaaaayyy better. I&#8217;m a <a href=\"http://whatisabrony.com/\">brony</a> in case you didn&#8217;t know (fan of My Little Pony: Friendship is Magic. Don&#8217;t hate). Ke$ha has a very self-confident and sassy tone of voice, so if I couldn&#8217;t have Ke$ha, I would get a self-confident and sassy voice over from someone else &#8211; namely <strong>Jessi Nowack</strong>. <em>Brohoof!</em></p>\n<p>If you&#8217;re not familiar with the brony fandom allow me to give you some background. Jessi Nowack is the de facto voice of the background character Vinyl Scratch (aka DJ PON3 &#8211; pictured below). What is so cool about this is that<em> Vinyl Scratch has never had any speaking lines on the show</em> &#8211; she is mute. The only times she has ever spoken are in fan-created content. So with the fan base being so dedicated to the characters, it stands to reason that if Hasbro Studios ever decided to give Vinyl speaking lines and Jessi didn&#8217;t voice her, the fan base would have a collective aneurysm!</p>\n<figure><img src=\"http://evbpmusic.com/wp-content/uploads/2015/10/vinyl-gray-216x300.png\" alt=\"vinyl gray\" width=\"216\" height=\"300\" class=\"alignnone size-medium wp-image-495\" style=\"float:right;\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/10/vinyl-gray-216x300.png 216w, https://evbpmusic.com/wp-content/uploads/2015/10/vinyl-gray.png 294w\" sizes=\"(max-width: 216px) 100vw, 216px\" /></figure><p>So that&#8217;s it everybody. Every track for the record is done and heading out to be mastered. I can&#8217;t thank people enough for the support, encouragement, patience, and beer that has gone into making this happen! After nearly three years of working on this thing I&#8217;m feeling like Dre after he released Compton (but seriously, 16 years between albums dude?!).</p>\n<p>You know what this means, right? Now I gotta get off my ass and play some shows! In front of an actual audience, instead of stuffed animals and house pets!! Anybody got a house party, garage sale, or birthday coming up?</p>\n",
    "excerpt": "<p>Hey internet! DJ-STFU-PLZ!!! This is it! The final track from The Mechanical Essence Of Whiskers. The one that took me three times longer to finish mixing than any other track on the album. I already gave you some background on the meaning of the track (lazy-ass DJs got me all like..). So I&#8217;m gonna use &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/10/completed-tracks-for-m-e-o-w-part-11-the-end-is-near/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 477,
    "date": "2015-10-02T23:02:20",
    "slug": "p-u-z-z-l-e-p-i-e-c-e-s",
    "header": "P.U.Z.Z.L.E.P.I.E.C.E.S.",
    "body": "<p>Sorry the last track is taking so long everyone. Life has been chaotic in the past couple weeks to say the least. I&#8217;m going to be working on it this Sunday, and I hope to finish it. Keep your fingers crossed for me!</p>\n<p>In the meantime, here are more puzzle pieces!</p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/10/piece16.jpg\" alt=\"piece16\" width=\"148\" height=\"58\" class=\"alignnone size-medium wp-image-478\"></p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/10/piece17.jpg\" alt=\"piece17\" width=\"209\" height=\"59\" class=\"alignnone size-medium wp-image-479\"></p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/10/piece15.jpg\" alt=\"piece15\" width=\"221\" height=\"107\" class=\"alignnone size-full wp-image-480\"></p>\n<p>Only two pieces left after these. Good luck!</p>\n",
    "excerpt": "<p>Sorry the last track is taking so long everyone. Life has been chaotic in the past couple weeks to say the least. I&#8217;m going to be working on it this Sunday, and I hope to finish it. Keep your fingers crossed for me! In the meantime, here are more puzzle pieces! Only two pieces left &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/10/p-u-z-z-l-e-p-i-e-c-e-s/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 469,
    "date": "2015-09-19T16:27:43",
    "slug": "heres-a-demo-for-you",
    "header": "Here&#8217;s a demo for you!",
    "body": "<h3><a href=\"http://evbpmusic.com/wp-content/uploads/2015/09/the-last-track.mp3\">Demo of the last track for M.E.O.W.</a></h3>\n<p>You&#8217;re probably wondering why I would want to post an old demo of a song that I&#8217;m getting ready to post an up to date, much more polished version of. The short answer? UNCLEARED SAMPLES! And while I am way more excited about the updated version of the song, I wanted you guys and gals to hear this one too.</p>\n<p>I sampled a very large chunk of a Madonna song for this one as well as voice samples of Kesha. You see, in a lot of radio pop music, DJs are often exhaulted and treated like the best thing ever. But if you&#8217;ve ever listened to Kiss FM or been to a nightclub, you know that some DJs are as bland, boring, and predictable as 90s sitcoms.</p>\n<p>I wanted to represent the opposite side of the argument.</p>\n<blockquote>\n<h3><strong>&#8220;Hey Mr. DJ! Stop being so goddamn lazy! Play something I didn&#8217;t hear in the car on the drive over here 4 or 5 times! And maybe try spinning those tracks with some style instead of just hitting play and walking away!&#8221;</strong></h3>\n</blockquote>\n<p>I feel like if you pay to get into a club and you buy drinks and a DJ has been given an opportunity to entertain you, they should make the most of it! Play something we wouldn&#8217;t expect! Try some mashups! Take us on a musical journey! Anything less is basically white noise and should not be held in high regard in pop music or anywhere else.</p>\n<p>Sooo anyway&#8230;</p>\n<p>I&#8217;ll be posting the new version of the song as well as the real title and more detail on it&#8217;s evolution, people involved (there are SOOO many!), et cetera in the very near future as well as some more puzzle pieces!</p>\n",
    "excerpt": "<p>Demo of the last track for M.E.O.W. You&#8217;re probably wondering why I would want to post an old demo of a song that I&#8217;m getting ready to post an up to date, much more polished version of. The short answer? UNCLEARED SAMPLES! And while I am way more excited about the updated version of the &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/09/heres-a-demo-for-you/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 464,
    "date": "2015-09-17T02:49:33",
    "slug": "i-hate-to-keep-teasing-you-all-but",
    "header": "I hate to keep teasing you all, but&#8230;",
    "body": "<p>The last track to be mixed for the record is going to be forshing erpic! More details on the final track later. In the mean time, here are some puzzle pieces. Have you figured out the track list yet? Only one track remains and then it&#8217;s pretty much all out in the open. Make your guesses while you still can!</p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/09/piece13.jpg\" alt=\"piece13\" width=\"75\" height=\"117\" class=\"alignnone size-medium wp-image-465\"></p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/09/piece14.jpg\" alt=\"piece14\" width=\"270\" height=\"116\" class=\"alignnone size-medium wp-image-466\"></p>\n",
    "excerpt": "<p>The last track to be mixed for the record is going to be forshing erpic! More details on the final track later. In the mean time, here are some puzzle pieces. Have you figured out the track list yet? Only one track remains and then it&#8217;s pretty much all out in the open. Make your &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/09/i-hate-to-keep-teasing-you-all-but/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 457,
    "date": "2015-08-31T03:02:08",
    "slug": "completed-tracks-for-m-e-o-w-part-uh-lets-just-call-it-9-ok",
    "header": "Completed Tracks for M.E.O.W. part&#8230;. uh&#8230; let&#8217;s just call it &#8220;9&#8221;. Ok?",
    "body": "<p>O&#8230; M&#8230; Gumdrops you guys! Only one track left to mix before M.E.O.W. gets shipped off to be mastered! I am so excited!!</p>\n<p>So, what is with the title of this post? &#8220;Let&#8217;s just call it &#8216;9&#8217;&#8221;? Well, y&#8217;know&#8230; cuz there are only 10 tracks on the record and I have 1 left&#8230; so&#8230; GET OFF MY BACK!!!!!!!!!</p>\n<p><strong><a href=\"http://evbpmusic.com/wp-content/uploads/2015/08/Pixel-Fix.mp3\">Pixel Fix</a></strong></p>\n<p>This is my attempt to write a song in a similar vein to <a href=\"https://shaelriley.bandcamp.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Shael Riley &amp; The Double Ice Backfire</a> &#8211; a combination of chiptune music with live instrumentation. If it wasn&#8217;t obvious, I&#8217;m <a href=\"https://www.youtube.com/watch?v=limIkGDuWDA\" target=\"_blank\" rel=\"noopener noreferrer\">a bit of a fan</a>. I also really want to give some mad props to Logan Witte &#8211; who played the live drums &#8211; and Pete Bishop (my stepdad) who did a ridiculous amount of post-processing to get the drums tracks to line up. I could have done this song without the live drums, but I feel like THIS is the best version. Also the drum sound is SOOOOO Steve Albini &#8211; big, boomy in all the right spots, and tight as hell!</p>\n<p>I gotta give you all a heads up, the next track will probably take a while to finish as there are A LOT of elements to it, and I want it to be perfect. Because I love you. Also, because I am a perfectionist.</p>\n<p>Anyway, enjoy the new tracks &#8211; collect all them puzzle pieces &#8211; <a href=\"https://www.youtube.com/watch?v=BgNn8RLHrhk\" target=\"_blank\" rel=\"noopener noreferrer\">make this world more like Equestria</a> &#8211; and keep your sense-holes peeled for the final track!</p>\n",
    "excerpt": "<p>O&#8230; M&#8230; Gumdrops you guys! Only one track left to mix before M.E.O.W. gets shipped off to be mastered! I am so excited!! So, what is with the title of this post? &#8220;Let&#8217;s just call it &#8216;9&#8217;&#8221;? Well, y&#8217;know&#8230; cuz there are only 10 tracks on the record and I have 1 left&#8230; so&#8230; GET &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/08/completed-tracks-for-m-e-o-w-part-uh-lets-just-call-it-9-ok/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 453,
    "date": "2015-08-30T21:52:43",
    "slug": "o-m-goodness-puzzle-pieces",
    "header": "O&#8230; M&#8230; Goodness! Puzzle Pieces!",
    "body": "<p>Track from last week is being cleaned up as we speak. With any luck, I will be able to post it here tonight. If the internet had fingers, would it cross them?</p>\n<p>In the meantime, I have some puzzle pieces for you.</p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/08/piece11-300x118.jpg\" alt=\"piece11\" width=\"300\" height=\"118\" class=\"alignnone size-medium wp-image-454\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/08/piece11-300x118.jpg 300w, https://evbpmusic.com/wp-content/uploads/2015/08/piece11.jpg 408w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><br />\n<img src=\"http://evbpmusic.com/wp-content/uploads/2015/08/piece12.jpg\" alt=\"piece12\" width=\"117\" height=\"231\" class=\"alignnone size-full wp-image-455\"></p>\n<p>Not sure if I mentioned this before, but <strong>the first five people to come up with the correct track listing for the album, get a physical copy in &#8216;da mail!</strong> To participate, collect the pieces (there are more on the way) and put them together. Then, drop me an email at fanmail [AT] evbpmusic [DOT] com with the track listing. I will announce the winners here on the site!</p>\n",
    "excerpt": "<p>Track from last week is being cleaned up as we speak. With any luck, I will be able to post it here tonight. If the internet had fingers, would it cross them? In the meantime, I have some puzzle pieces for you. Not sure if I mentioned this before, but the first five people to &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/08/o-m-goodness-puzzle-pieces/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 431,
    "date": "2015-08-17T02:38:28",
    "slug": "puzzle-pieces-to-tide-you-over",
    "header": "Puzzle Pieces To Tide You Over",
    "body": "<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/08/StraightOuttaSomewhere-300x300.jpg\" alt=\"StraightOuttaSomewhere\" width=\"300\" height=\"300\" class=\"alignnone size-medium wp-image-437\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/08/StraightOuttaSomewhere-300x300.jpg 300w, https://evbpmusic.com/wp-content/uploads/2015/08/StraightOuttaSomewhere-150x150.jpg 150w, https://evbpmusic.com/wp-content/uploads/2015/08/StraightOuttaSomewhere-140x140.jpg 140w, https://evbpmusic.com/wp-content/uploads/2015/08/StraightOuttaSomewhere-350x350.jpg 350w, https://evbpmusic.com/wp-content/uploads/2015/08/StraightOuttaSomewhere.jpg 846w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><br />\nThat&#8217;s right, <strong>P2T2 YO</strong>! Sorry, with all the <em>Straight Outta Compton</em> memes I couldn&#8217;t resist doing my own. Because I had a headache. And no ibuprofen. Do you like it? Anyway, about those puzzle pieces. Here they are!</p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/08/piece7.jpg\" alt=\"BAM!\" width=\"253\" height=\"117\" class=\"alignnone size-full wp-image-433\" style=\"float:left;\">And if you&#8217;re reading this, I&#8217;m sure you want more detail on why you&#8217;re not getting an MP3 this week. The next track I plan to upload felt like it was lacking something. And the object of lack was real, live drums! So Pete and I spent this afternoon recording drums with his friend <strong>Logan Witte</strong>. I wasn&#8217;t sure what to expect, as I had never heard him drum before, but Pete assured me that he was a talented guy.</p>\n<h3><strong>He was right.</strong></h3>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/08/piece8.jpg\" alt=\"BAM!\" width=\"90\" height=\"195\" class=\"alignnone size-full wp-image-434\" style=\"float:right;\">I don&#8217;t know how many takes it usually takes most drummers, but Logan &#8211; having never heard the song before &#8211; managed to kill it in less than four takes! I was also really impressed (and thankful) that I didn&#8217;t have to spell out every pattern or try to play it for him first (I haven&#8217;t played the drums in years, so I&#8217;m really out of practice). Other than a few guiding points (lots of toms, drop out here, etc) he seemed to have an instinct for what to play. I can&#8217;t wait to post the mp3 for you. I&#8217;m sure you&#8217;re gonna love it!</p>\n",
    "excerpt": "<p>That&#8217;s right, P2T2 YO! Sorry, with all the Straight Outta Compton memes I couldn&#8217;t resist doing my own. Because I had a headache. And no ibuprofen. Do you like it? Anyway, about those puzzle pieces. Here they are! And if you&#8217;re reading this, I&#8217;m sure you want more detail on why you&#8217;re not getting an &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/08/puzzle-pieces-to-tide-you-over/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 425,
    "date": "2015-08-11T01:09:48",
    "slug": "completed-tracks-for-m-e-o-w-pt-10",
    "header": "Completed tracks for M.E.O.W. Pt 10",
    "body": "<p>So if this is Part 10, and there are 10 tracks on the album&#8230; <em>What the floppy disk?!</em> I haven&#8217;t exactly been religious about the numeric consistency of these. Plus, I have announced tracks and not posted mp3s at the same time, so I guess I&#8217;m innocent. But think positive! <strong>8 of 10 tracks for the album are ready for mastering!</strong></p>\n<p>And to end your wait, here it is! The track I dangled in front of your faces yesterday. Here for your listening enjoyment!</p>\n<p><a href=\"http://evbpmusic.com/wp-content/uploads/2015/08/Decipher-This-Song.mp3\">Decipher This Song (featuring MC Lars)</a></p>\n<p>I know it seems silly, but doing a track with an established, internationally known artist makes me feel like I have &#8220;made it&#8221;. On the upside, Lars is a genuinely talented guy and it&#8217;s a privilege to get to do a song with him &#8211; celebrity or no. Besides, &#8220;making it&#8221; is all relative. That guy at the local &#8220;open mic night&#8221; showing up and playing songs that he loves and doing his own thing without concern for being rich and famous has &#8220;made it&#8221;. Kanye West has &#8220;made it&#8221;. The one guy who won American Idol a couple years ago (you know the one I&#8217;m talking about!), he&#8217;s &#8220;made it&#8221;. Success is what you make of it.</p>\n<p>Two more tracks everyone! The album will be ready before you know it. In the meantime, have fun figuring out the puzzle pieces, and <em>deciphering the song!</em></p>\n",
    "excerpt": "<p>So if this is Part 10, and there are 10 tracks on the album&#8230; What the floppy disk?! I haven&#8217;t exactly been religious about the numeric consistency of these. Plus, I have announced tracks and not posted mp3s at the same time, so I guess I&#8217;m innocent. But think positive! 8 of 10 tracks for &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/08/completed-tracks-for-m-e-o-w-pt-10/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 413,
    "date": "2015-08-10T03:38:18",
    "slug": "not-quite-a-new-track-for-m-e-o-w",
    "header": "Not quite a new track for M.E.O.W&#8230;",
    "body": "<p><em>What the heck does that mean?!</em> What it means is that I thought I would have a track ready for you tonight. Unfortunately, after listening to the finished mix in my car on the drive home and at home on my laptop, a certain part of the track was not sitting right with me. So I have decided to refrain from posting the mp3 here (at least for a few more days), because I don&#8217;t want to risk that you&#8217;ll be as critical of the track as I am and as such think it is less than awesome.</p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/08/piece5.jpg\" alt=\"piece5\" width=\"172\" height=\"187\" class=\"alignnone size-full wp-image-410\" style=\"float:left;\">So why am I updating the site, if not to give you a new track? Three reasons. First, because I love you. Second, to give you a new puzzle piece (OMG! Puzzizzle Pizzieces!). And threed, to drop some well-deserved props on the rapper who made a guest appearance on the latest track.</p>\n<p>Andrew Nielsen, AKA <a href=\"http://mclars.com/site/\">MC Lars</a> is one of the hardest working rappers I know. He&#8217;s also one of the most personable and approachable. I emailed him an mp3 of one of my tracks back in 2010 (&#8220;Jolt&#8221;, in case you were wondering), and he was really enthusiastic about it. I was on cloud number 9! Number 9! #9!</p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/08/lars-300x286.jpg\" alt=\"He does't look like this in real life!\" width=\"300\" height=\"286\" class=\"alignnone size-medium wp-image-415\" style=\"float:right;\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/08/lars-300x286.jpg 300w, https://evbpmusic.com/wp-content/uploads/2015/08/lars-1024x976.jpg 1024w, https://evbpmusic.com/wp-content/uploads/2015/08/lars.jpg 1273w\" sizes=\"(max-width: 300px) 100vw, 300px\" />I remember being a nervous wreck when I contacted him back in 2011 asking if I could interview him when he was on his upcoming tour with MC Chris. Because I&#8217;m the type, when I really admire an artist, I want to know everything about them! I think Henry Rollins once said &#8220;<em>I want to know what they ate for breakfast on July 17, 1978!</em>&#8221; I may have the date wrong, but the sentiment is the same &#8211; <em>I want to find out what makes them tick</em>. So the opportunity to interview Lars was something I really looked forward to!</p>\n<p>Following an interview conducted in the alley next to the <a href=\"http://www.blindpigmusic.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Blind Pig</a>, Lars said <strong>&#8220;If you ever want me on a track, get in touch!&#8221;</strong> This was just too tempting to ignore! Being on a track with one of my heroes? <em>Where the fudgsicle do I sign up</em>?! So I continued working on the tracks that would become M.E.O.W. I finally got a brilliant idea in my head, and I wanted Lars to be a part of that brilliant idea! I contacted him with the song idea. He let me know if I could cover the time in the studio to record his vocal take, he would lay down a track.</p>\n<p>I did.</p>\n<p>He did.</p>\n<p>And now you have to wait a few more days to hear it! <strong>AAAUUUUUUUUGGGGHHHHH!!!!!! You feel the same as Lars up there, don&#8217;t you?!</strong></p>\n<p>But anyway it&#8217;s getting late and this post should let you know about Lars. Because I owe him a shout-out, and because Lars, man!!!</p>\n<p>He has a new crowd-funded album coming out, <em><a href=\"https://www.kickstarter.com/projects/horrisrecords/mc-lars-the-zombie-dinosaur-lp\" target=\"_blank\" rel=\"noopener noreferrer\">The Zombie Dinosaur LP</a></em>. Being an avid supporter I haven&#8217;t heard ALL of the tracks, but I have heard a few (and I&#8217;ll hear the rest when I get my copy of the crowd-funded album!). I&#8217;ve have heard this one, which if you aren&#8217;t stupid (&#8230;you&#8217;re not STUPID, are you??) you should check out.</p>\n<p><a href=\"https://www.youtube.com/watch?v=vxjB2f8LakE\">I&#8217;ve got <strong>Dragon Blood</strong>, what you wanna do, son?!</a></p>\n<p>Oh, by the way if you&#8217;re not familiar with the rest of Lars&#8217; catalog, allow me to drop some youtubes on youse!</p>\n<p><a href=\"https://www.youtube.com/watch?v=j8Z0VynTR84\" target=\"_blank\" rel=\"noopener noreferrer\">Flow Like Poe</a></p>\n<p><a href=\"https://www.youtube.com/watch?v=VBkuiChImb8\" target=\"_blank\" rel=\"noopener noreferrer\">Download This Song</a></p>\n<p><a href=\"https://www.youtube.com/watch?v=twL3oBlITT8\" target=\"_blank\" rel=\"noopener noreferrer\">White Kids Aren&#8217;t Hyphy</a></p>\n<p>So continue holding your breath for a few more days! The new track is on it&#8217;s way. And that means there are only two more tracks remaining until the completion of M.E.O.W. Pur, my pretties&#8230; pur.</p>\n",
    "excerpt": "<p>What the heck does that mean?! What it means is that I thought I would have a track ready for you tonight. Unfortunately, after listening to the finished mix in my car on the drive home and at home on my laptop, a certain part of the track was not sitting right with me. So &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/08/not-quite-a-new-track-for-m-e-o-w/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 409,
    "date": "2015-08-06T02:34:55",
    "slug": "puzzle-piece-yes",
    "header": "Puzzle Piece? Yes!!",
    "body": "<p>I love you guys (and gals)! I hope you will be my fans for ever and ever and ever and ever and ever and ever and ever andoh wait, I have a puzzle piece for you! Happy and stuffs!</p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/08/piece5.jpg\" alt=\"piece5\" width=\"172\" height=\"187\" class=\"alignnone size-full wp-image-410\" style=\"float:left;\"></p>\n<p>Can anyone explain why WP automatically surrounds images with hyperlinks? Seems pointless.</p>\n<p>Will you also get a new mp3 from the album this week?! Only time will tell, because I&#8217;m not gonna tell you. I want it to be a surprise. A surprise!!!!!</p>\n",
    "excerpt": "<p>I love you guys (and gals)! I hope you will be my fans for ever and ever and ever and ever and ever and ever and ever andoh wait, I have a puzzle piece for you! Happy and stuffs! Can anyone explain why WP automatically surrounds images with hyperlinks? Seems pointless. Will you also get &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/08/puzzle-piece-yes/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 393,
    "date": "2015-07-27T20:55:09",
    "slug": "completed-tracks-for-m-e-o-w-pt-9",
    "header": "Completed tracks for M.E.O.W. Pt 9",
    "body": "<p><img class=\"alignnone size-medium wp-image-396\" style=\"float: left;\" src=\"http://evbpmusic.com/wp-content/uploads/2015/07/EVBP_explicit-300x197.jpg\" alt=\"EVBP_explicit\" width=\"300\" height=\"197\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/07/EVBP_explicit-300x197.jpg 300w, https://evbpmusic.com/wp-content/uploads/2015/07/EVBP_explicit-1024x674.jpg 1024w, https://evbpmusic.com/wp-content/uploads/2015/07/EVBP_explicit.jpg 1296w\" sizes=\"(max-width: 300px) 100vw, 300px\" /> <em><strong>&#8220;Hey! You made it sound like you were gonna have a new track for us last last week! What gives?&#8221;</strong></em></p>\n<p>I know! Sorry everyone. Long story short, the track <strong>was</strong> ready last week. However, the first time it was rendered to mp3, I noticed the sound effects track had not rendered along with the rest of the mix. I mentioned this to Pete the next day, and he dropboxed me a new copy. After downloading this version and listening to it, I discovered that it sounded very choppy.</p>\n<p>So after a very busy week at work, I finally got a chance to sit down with Pete and render the mp3 once again. So without further ado, here it is!</p>\n<p><strong><a href=\"http://evbpmusic.com/wp-content/uploads/2015/07/Washington-Wives.mp3\">Washington Wives</a></strong></p>\n<p>When I was in elementary school and first discovering music, I used to get really frustrated because the albums that always had the coolest looking artwork were also the albums that had &#8220;Parental Advisory: Explicit Lyrics&#8221; labels stuck to them. It was a couple years before I would finally buy many of these albums, because I remember my parents taking away my copy of Vanilla Ice&#8217;s <em>To The Extreme</em> because they thought the content was inappropriate. I didn&#8217;t want to buy a tape or CD that I figured my parents were just going to take away from me.</p>\n<p><img class=\"alignnone size-medium wp-image-404\" style=\"float: right;\" src=\"http://evbpmusic.com/wp-content/uploads/2015/07/IMG_0493-300x225.jpg\" alt=\"censored_albums\" width=\"300\" height=\"225\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/07/IMG_0493-300x225.jpg 300w, https://evbpmusic.com/wp-content/uploads/2015/07/IMG_0493-1024x768.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\" />As a teenager, I discovered the origin of the advisory labels. I also discovered the not-so-innocent history of court trials that followed in the wake of the PMRC&#8217;s founding. Jello Biafra became something of a spiritual advisor. I remember my disgust seeing the censored version of Nirvana&#8217;s <em>In Utero</em> on Wal-Mart shelves. I remember having to walk through a crowd of religious protesters at a Marilyn Manson concert. I remember rushing out to the local Sam Goody where my cousin worked, and getting her to sell me a copy of ICP&#8217;s <em>The Great Milenko</em> after seeing how it was being pulled from shelves as a result of pressure from the Southern Baptist Church on MTV News.</p>\n<p>The world didn&#8217;t end. Many of the musicians whose music changed my life are still active today. The PMRC however, went belly-up long ago. And yet record labels both big and small, continue to put parental advisory labels on the albums they release. Now permanently printed over the front cover of the record. So I think it is safe to say that Tipper and her fellow Washington Wives are still winning the war to this day.</p>\n<p><strong>Anyway, as an apology for taking so long to get you guys the new track, I am giving you not one, but TWO mp3 this time. This is a remix of &#8220;Chickenz&#8221; that I did way back in 2013. I was initially planning to hold onto it until I reached 100 facebook fans, but withholding music from fans ain&#8217;t cool. So please enjoy these new tracks!</strong></p>\n<p><strong><a href=\"http://evbpmusic.com/wp-content/uploads/2015/07/Chickenz-Hit-Remix.mp3\">Chickenz (Hit Remix)</a></strong></p>\n",
    "excerpt": "<p>&#8220;Hey! You made it sound like you were gonna have a new track for us last last week! What gives?&#8221; I know! Sorry everyone. Long story short, the track was ready last week. However, the first time it was rendered to mp3, I noticed the sound effects track had not rendered along with the rest &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/07/completed-tracks-for-m-e-o-w-pt-9/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 387,
    "date": "2015-07-18T03:36:21",
    "slug": "new-puzzle-piece-yay",
    "header": "New puzzle piece! Yay!",
    "body": "<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/07/piece4.jpg\" alt=\"piece4\" width=\"108\" height=\"126\" class=\"alignnone size-full wp-image-388\" style=\"float:left;\" />Another one of these little geometric things for you! They will keep coming, like snow flakes in winter! Until they stop&#8230; like snow flakes in winter.</p>\n<p>If you have been paying attention to the updates here, then you may notice the pattern that I tend to post about completed mixes on Sunday&#8230; Well, hopefully this Sunday will be no different! I am getting together with Pete to finish(???) another mix this weekend. And as is also a part of the pattern, I will post an mp3 here when it&#8217;s ready. Like the header says, &#8220;Yay!&#8221;</p>\n<p>I will also give an update on the status of the pedal board in the near future. At present, it is <em>built</em>, I am just in the process of arranging pedals, positioning them ergonomically, and attempting to get the signal-to-noise ratio.</p>\n<p>Stay tuned!</p>\n",
    "excerpt": "<p>Another one of these little geometric things for you! They will keep coming, like snow flakes in winter! Until they stop&#8230; like snow flakes in winter. If you have been paying attention to the updates here, then you may notice the pattern that I tend to post about completed mixes on Sunday&#8230; Well, hopefully this &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/07/new-puzzle-piece-yay/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 380,
    "date": "2015-07-06T01:56:08",
    "slug": "completed-tracks-for-m-e-o-w-pt-8",
    "header": "Completed tracks for M.E.O.W. Pt 8",
    "body": "<p>Hi everybody!</p>\n<p>A couple weeks back I said that one of the tracks completed was &#8220;Candytosis&#8221;. Unfortunately, the final mix of that was lost. So this week Pete and I mixed it again. I&#8217;m presenting it as the pre-master download for the present. So without further ado, here is </p>\n<p><a href=\"http://evbpmusic.com/wp-content/uploads/2015/07/Candytosis-Sweet-Tooth-II.mp3\">Candytosis (Sweet Tooth II)</a></p>\n<p>If you are not familiar with the rest of my catalog, let me give you a little background on this track. It is the logical sequel to <a href=\"https://experimentalvoiceboxprogrammer.bandcamp.com/track/sweet-tooth\">Sweet Tooth</a> from my album <a href=\"https://experimentalvoiceboxprogrammer.bandcamp.com/album/lo-fi-mouth\">Lo-Fi Mouth</a>. The song is all about sweet stuff (with a title like &#8216;Sweet Tooth&#8217;, what did you expect?). I&#8217;m not sure what inspired me to write another song all about sweets, considering I personally do not have much of a sweet tooth (except when it comes to Jolt&#8230;), but &#8220;Candytosis&#8221; is the result.</p>\n<p>I have a few tracks left. I am being very meticulous about them. Changing parts here and there. I&#8217;m beginning to realize that being anal about the final mix of a track doesn&#8217;t compensate for the overall track lacking in spots. So I am taking a little extra time with the remaining tracks to add parts, change parts, and re-analyze existing parts. You all deserve the best and I deserve to release an album I am 100% satisfied with.</p>\n<p>Enjoy the new track, and keep your eyes and ears peeled for more tracks, puzzle pieces, and updates on the pedal board!</p>\n",
    "excerpt": "<p>Hi everybody! A couple weeks back I said that one of the tracks completed was &#8220;Candytosis&#8221;. Unfortunately, the final mix of that was lost. So this week Pete and I mixed it again. I&#8217;m presenting it as the pre-master download for the present. So without further ado, here is Candytosis (Sweet Tooth II) If you &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/07/completed-tracks-for-m-e-o-w-pt-8/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 367,
    "date": "2015-07-02T03:11:33",
    "slug": "holy-stuff-i-owe-you-a-new-puzzle-piece",
    "header": "Holy stuff! I owe you a new puzzle piece!",
    "body": "<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/07/tkk-300x135.jpg\" alt=\"tkk\" width=\"300\" height=\"135\" class=\"alignnone size-medium wp-image-368\" style=\"float:left;\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/07/tkk-300x135.jpg 300w, https://evbpmusic.com/wp-content/uploads/2015/07/tkk-1024x460.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\" />What&#8217;s happened in the last week? I went to The Token Lounge and saw the one and only <strong>My Life With The Thrill Kill Kult</strong>! It was epic!! It&#8217;s always exciting to see a band that has been doing awesome things for years and just continues to get better and better! Check it out! Buzz McCoy (Left, keyboards), Mimi Star (Middle, bass &#8211; Oh my gosh, I want to marry her!), and Groovy Mann (Right, lead vocals) tearing it up in the Motor City!</p>\n<p>My apologies that I don&#8217;t have a new mp3 for your listening pleasure. Presently, I am working on putting the finishing touches on two of the tracks for the album. Just trying to decide which one to &#8216;finalize&#8217; next. Regardless of which song I choose, you will be presented with an MP3 of a song. MP3s are wonderful, ain&#8217;t they? You can listen to them on your computer, or your iPod/iPhone/mp3 player/Other Modern Device! In the meantime, please accept this additional puzzle piece as a token of my esteem. It marks piece #3 in the ongoing puzzle piece mystery! (hint: It wasn&#8217;t Col. Mustard in the Library with a candle stick!)<a href=\"http://evbpmusic.com/wp-content/uploads/2015/07/piece3.jpg\"><img src=\"http://evbpmusic.com/wp-content/uploads/2015/07/piece3.jpg\" alt=\"piece3\" width=\"195\" height=\"129\" class=\"alignnone size-full wp-image-369\" style=\"float:left;\"/></a></p>\n<p>Stay weird, you weirdos!</p>\n",
    "excerpt": "<p>What&#8217;s happened in the last week? I went to The Token Lounge and saw the one and only My Life With The Thrill Kill Kult! It was epic!! It&#8217;s always exciting to see a band that has been doing awesome things for years and just continues to get better and better! Check it out! Buzz &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/07/holy-stuff-i-owe-you-a-new-puzzle-piece/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 363,
    "date": "2015-06-22T01:38:22",
    "slug": "new-puzzle-piece",
    "header": "New puzzle piece!",
    "body": "<p><a style=\"float: left;\" href=\"http://evbpmusic.com/wp-content/uploads/2015/06/piece2.jpg\"><img class=\"alignnone size-full wp-image-364\" src=\"http://evbpmusic.com/wp-content/uploads/2015/06/piece2.jpg\" alt=\"piece2\" width=\"217\" height=\"123\" /></a>Do with it what you will. These will keep on coming!</p>\n",
    "excerpt": "<p>Do with it what you will. These will keep on coming!</p>\n",
    "metaTags": []
  },
  {
    "id": 332,
    "date": "2015-06-20T04:32:46",
    "slug": "this-old-pedal-board-pt-2-and-puzzisle-piecizzles-pt-1",
    "header": "This Old Pedal Board, Pt. 2 and Puzzisle Piecizzles? Pt. 1",
    "body": "<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/06/IMG_0457-300x225.jpg\" alt=\"IMG_0457\" width=\"300\" height=\"225\" class=\"alignnone size-medium wp-image-336\" style=\"float:left;\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/06/IMG_0457-300x225.jpg 300w, https://evbpmusic.com/wp-content/uploads/2015/06/IMG_0457-1024x768.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\" /> The pedal board is bordering on finished! Since I last updated you on the status of it, it has been painted, and velcroed. BOOSH!! Eat your heart out Bob Vila, you bearded&#8230; carpenter&#8230; guy, you! Sadly, I had to settle for velco strips that were smaller than the width of the boards. But no matter, as long as the pedals adhere to it, that&#8217;s all that matters. I also tried out one of those 1-Spot daisy-chain power supplies. In regards to that, I can say this: if you have anything more than 3-4 pedals (which I do), save your money. Those things are horrifically noisy!</p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/06/dod_fx75b.jpg\" alt=\"dod_fx75b\" width=\"150\" height=\"206\" class=\"alignnone size-full wp-image-333\" style=\"float:right;\" />I have also swapped out the unweildy (screw you WordPress, it <em>is</em> spelled correctly) MXR flanger unit for a DOD FX-75B which aside from not requiring a dedicated plug and being far more compact in size, also has the wonderful distinction of having an optional stereo output. Think of the sonic possibilities &#8211; I can flange in stereo! Before the completion of the board I still intend to get my hands on an EQ pedal, a reverb pedal, and a tuner. Being a low-budget kinda guy, I will likely keep my eye on the used market for these. I mean, let&#8217;s face it &#8211; most guitar pedals are built like tanks anyway! Oh, and screw boutique pedals. I have yet to hear one that sounds like it is worth the absurdly high prices that boutique pedal manufacturers want for it.</p>\n<p>But let&#8217;s get to why you are really here. You like my music (or at least think it is strange enough to be worth your interest). And as such, you want more of it. And you want to be given the opportunity to get one of my CDs (or a couple of my CDs) before everybody else, right? Of course I&#8217;m right. I mean, you&#8217;re obviously not here for your health.</p>\n<p><a href=\"http://evbpmusic.com/wp-content/uploads/2015/06/piece1.jpg\"><img src=\"http://evbpmusic.com/wp-content/uploads/2015/06/piece1.jpg\" alt=\"piece1\" width=\"121\" height=\"126\" class=\"alignnone size-full wp-image-345\" style=\"float:left;\" /></a><strong><<< Last week, I promised that I would be giving you puzzle pieces</strong> to help decipher the track list from the upcoming album. The puzzle pieces are now dropping like bombs! There are 19 puzzle pieces in total (yeah I know it&#8217;s a weird number, what did you expect from a weirdo like me?!) and I highly doubt the album is going to take me another 19 weeks to finish mixing and mastering, so I will likely be releasing one or more puzzle pieces each week until I have the physical copies in my caffeinated little fingers.</p>\n<p>Remember the clues I have given you so far: 10 tracks in total, and 6 of the 10 tracks are done and have been identified in previous blog posts.</p>\n<p>Good luck!</p>\n",
    "excerpt": "<p>The pedal board is bordering on finished! Since I last updated you on the status of it, it has been painted, and velcroed. BOOSH!! Eat your heart out Bob Vila, you bearded&#8230; carpenter&#8230; guy, you! Sadly, I had to settle for velco strips that were smaller than the width of the boards. But no matter, &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/06/this-old-pedal-board-pt-2-and-puzzisle-piecizzles-pt-1/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 324,
    "date": "2015-06-15T02:57:08",
    "slug": "completed-tracks-for-m-e-o-w-pt-7",
    "header": "Completed tracks for M.E.O.W. Pt 7",
    "body": "<p>Hey everyone! No new track to report, but I do have another mp3 for your enjoyment!</p>\n<p><a href=\"http://evbpmusic.com/wp-content/uploads/2015/06/Leaf-of-Forgiveness.mp3\">Leaf of Forgiveness</a></p>\n<p>I STILL have no idea what this song is about. It&#8217;s a riddle, wrapped in a mystery, inside an enigma, frozen in carbonite! Speaking of such things, within the next week I will begin releasing the puzzle pieces needed to decipher the track list of the album. I&#8217;ve already revealed the names of 6 tracks from the record. Only 4 more to go!</p>\n<p>Also, keep an eye on the Upcoming shows sidebar. I haven&#8217;t performed in front of an audience since August of 2013. The weird has been dormant for far too long&#8230;</p>\n<h3><strong>2015 shall mark the return of weird to a stage near you!</strong></h3>\n",
    "excerpt": "<p>Hey everyone! No new track to report, but I do have another mp3 for your enjoyment! Leaf of Forgiveness I STILL have no idea what this song is about. It&#8217;s a riddle, wrapped in a mystery, inside an enigma, frozen in carbonite! Speaking of such things, within the next week I will begin releasing the &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/06/completed-tracks-for-m-e-o-w-pt-7/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 308,
    "date": "2015-06-12T03:17:17",
    "slug": "this-old-pedal-board-part-1",
    "header": "This Old Pedal Board, Part 1",
    "body": "<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/06/bobvila-225x300.jpg\" alt=\"bobvila\" width=\"225\" height=\"300\" class=\"alignnone size-medium wp-image-311\" style=\"float: left;\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/06/bobvila-225x300.jpg 225w, https://evbpmusic.com/wp-content/uploads/2015/06/bobvila.jpg 240w\" sizes=\"(max-width: 225px) 100vw, 225px\" /> I felt it necessary to invoke the spirit of Bob Vila. Wait, he&#8217;s not dead? Oh good. So if I screw this up, I can always get ahold of him and ask for his help! Hooray for DIY craftsmanship! </p>\n<p>If you&#8217;ve ever thought about making a pedal board, then you have probably seen one of the <a href=\"https://www.youtube.com/watch?v=dgsrZ0QWD5whttp://\" title=\"youtube videos\">youtube videos</a> explaining how to do so with a Gorm shelf from IKEA. As far as I can tell, the Gorm shelf is no more. It has been replaced by the Hejne shelf. The overall dimensions are comparable, but the gap between the boards is a little wider. </p>\n<p>The Hejne shelves come in a pack of two (at least it does for the shelf dimensions I needed to accommodate all of my pedals). The advantage to the shelves coming in a pack of two is that I can now put a second tier on my pedal board by cutting one of the two shelves in half (it&#8217;s actually less than half as you can see from the picture, but you get the idea). This way, the pedals on top are not obstructed by the pedals on the bottom.</p>\n<p><img src=\"http://evbpmusic.com/wp-content/uploads/2015/06/IMG_0451-300x225.jpg\" alt=\"IMG_0451\" width=\"300\" height=\"225\" class=\"alignnone size-medium wp-image-309\" style=\"float: right;\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/06/IMG_0451-300x225.jpg 300w, https://evbpmusic.com/wp-content/uploads/2015/06/IMG_0451-1024x768.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></p>\n<p>My next step will be to paint the shelf (because I said so, that&#8217;s why). Of course, it would also be a good idea to figure out what order the pedals are going to be arranged in&#8230; and figure out how best to attach the top shelf to the bottom&#8230; and of course, plan for further expansion! I could use a compressor pedal, and a volume pedal, and an eq pedal, and I&#8217;ve always wanted to have a talk box&#8230; and a tremolo pedal, and a&#8230;</p>\n",
    "excerpt": "<p>I felt it necessary to invoke the spirit of Bob Vila. Wait, he&#8217;s not dead? Oh good. So if I screw this up, I can always get ahold of him and ask for his help! Hooray for DIY craftsmanship! If you&#8217;ve ever thought about making a pedal board, then you have probably seen one of &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/06/this-old-pedal-board-part-1/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 302,
    "date": "2015-06-09T23:28:35",
    "slug": "completed-tracks-for-m-e-o-w-part-6",
    "header": "Completed Tracks for M.E.O.W. part 6",
    "body": "<p>Hey everybody! Sadly, no new mixes to report this week. Buuuuuuuuuuuutttttt&#8230;. I have a new mp3 for you! I know. I&#8217;m as happy as you are!</p>\n<p><a href=\"http://evbpmusic.com/wp-content/uploads/2015/06/Super-Coffee.mp3\">Super Coffee</a></p>\n<p>In addition to working on mixes for the new record, I am in the process of building a pedal board. Fellow music geeks will appreciate this and want to see pictures as it develops, so I will be posting those along with mix updates, mp3s and random, violent outbursts of the lulz. Brace yourselves! </p>\n<p><strong>Picture #1</strong><br />\n<a href=\"http://evbpmusic.com/wp-content/uploads/2015/06/pedalboard1.jpg\"><img src=\"http://evbpmusic.com/wp-content/uploads/2015/06/pedalboard1-300x225.jpg\" alt=\"pedalboard1\" width=\"300\" height=\"225\" class=\"alignnone size-medium wp-image-304\" srcset=\"https://evbpmusic.com/wp-content/uploads/2015/06/pedalboard1-300x225.jpg 300w, https://evbpmusic.com/wp-content/uploads/2015/06/pedalboard1.jpg 960w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p>Oh, hey what would you all think of a little <strong>puzzle to solve</strong>? In the weeks before the album is mastered and finished, I&#8217;ll be posting a pic each week that is part of the tracklist of the album. The first person to send me a copy of the complete track list wins</p>\n<p><strong>1) A signed copy of M.E.O.W.<br />\n2) A signed copy of The X of Art<br />\n3) A shoutout on facebook, twitter, and youtube!<br />\n4) A clue about the next album</strong></p>\n<p>You couldn&#8217;t ask for more! Well, you could but expecting it would be a little greedy. Stay tuned for more updates on M.E.O.W.!</p>\n",
    "excerpt": "<p>Hey everybody! Sadly, no new mixes to report this week. Buuuuuuuuuuuutttttt&#8230;. I have a new mp3 for you! I know. I&#8217;m as happy as you are! Super Coffee In addition to working on mixes for the new record, I am in the process of building a pedal board. Fellow music geeks will appreciate this and &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/06/completed-tracks-for-m-e-o-w-part-6/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 297,
    "date": "2015-06-01T01:49:35",
    "slug": "completed-tracks-for-m-e-o-w-part-5",
    "header": "Completed Tracks for M.E.O.W. Part 5",
    "body": "<p>Just a short update this time around&#8230; along with a short song!</p>\n<p>6 out of 10 tracks have now reached final mix stage! The latest song to join the roster is</p>\n<p><code>6. Super Coffee</code></p>\n<p>My previous employer put a Keurig in the break room, so employees could make themselves a cup of coffee. One day as I was brewing a cup of coffee, I got to thinking <em>what if someone were to brew a cup of coffee using already-brewed coffee in place of water?</em> Super Coffee of course! Naturally, the caffeine content would be higher. So high in fact, that one would be driven to illegal-drug levels of hyperactivity as a result of drinking it. But enough about coffee, here is another final mix for your listening pleasure:</p>\n<p><a href=\"http://evbpmusic.com/wp-content/uploads/2015/06/Kittens-and-Warm-Cocoa.mp3\">Kittens and Warm Cocoa</a></p>\n<p>Now, I have to warn you, before you play this new track &#8211; for the love of all that is good, TURN YOUR VOLUME DOWN!! Then once you have done that, turn it up, up, UP! A music video of this may (or may not) exist in the near future.</p>\n<p>I will have another update (and possibly another mp3) for your enjoyment next week. Thank you for your support!</p>\n",
    "excerpt": "<p>Just a short update this time around&#8230; along with a short song! 6 out of 10 tracks have now reached final mix stage! The latest song to join the roster is 6. Super Coffee My previous employer put a Keurig in the break room, so employees could make themselves a cup of coffee. One day &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/06/completed-tracks-for-m-e-o-w-part-5/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 292,
    "date": "2015-05-25T03:23:54",
    "slug": "completed-tracks-for-m-e-o-w-part-4",
    "header": "Completed Tracks for M.E.O.W. Part 4",
    "body": "<p>In case you missed it internet, my brother was in the hospital last week &#8211; not doing so great. On assisted breathing and everything. But now a week later he is approaching his usual awesome self. Can&#8217;t tell you how happy that makes me. Your patience during these difficult times is greatly appreciated!</p>\n<p>Now then, do you like free songs internet? Let&#8217;s be honest &#8211; Of course you do! If you didn&#8217;t you would be one of those abstract objects that doesn&#8217;t like free songs! And we all know those are few and far between. The latest song to reach pre-mastering completion is</p>\n<p><code>05. Pepperidge Farm</code></p>\n<p>And here is the download link! </p>\n<p><a href=\"http://evbpmusic.com/wp-content/uploads/2015/05/Peppridge-Fams.mp3\">Peppridge Fams</a></p>\n<p>I will be posting even more free mp3s from the upcoming album in the near future, so get them while you can! Oh, and if you want to see footage from the studio, check out the <a href=\"https://youtu.be/oRpyERauXLw\" title=\"youtube channel\" target=\"_blank\">youtube channel</a> for more candid (and sexy) footage.</p>\n<p>Happy Memorial Day and stay weird, internet!</p>\n",
    "excerpt": "<p>In case you missed it internet, my brother was in the hospital last week &#8211; not doing so great. On assisted breathing and everything. But now a week later he is approaching his usual awesome self. Can&#8217;t tell you how happy that makes me. Your patience during these difficult times is greatly appreciated! Now then, &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/05/completed-tracks-for-m-e-o-w-part-4/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 287,
    "date": "2015-05-15T03:00:11",
    "slug": "completed-tracks-for-m-e-o-w-part-3",
    "header": "Completed Tracks For M.E.O.W. Part 3",
    "body": "<p>You should feel totally special, internet. I&#8217;m spoiling the fuck out of you this week! I have not one, not two, but&#8230; oh wait. Yeah, two! Two songs titles to post this week:</p>\n<p><code>3. Leaf of Forgiveness</code><br />\n<code>4. Kittens and Warm Cocoa</code></p>\n<p>I swear the first one is not about pot! I&#8217;m actually not entirely sure what it&#8217;s about, but it&#8217;s pretty dang catchy. The second one features my good friend Mr. Tony Raines of the band Ruin Your Life. I got on the Facebook and I said, &#8220;I need someone to play the guitar like they could do one of those instructional guitar lesson VHS tapes from the early 90s&#8221; and Tony arose to the challenge. And blew the challenge out of the proverbial water!</p>\n<p>Two songs completed not enough for you, internet?! Want more? Ok, well how about this? A new, as of yet unreleased track from the upcoming album. Last week&#8217;s final mix version of &#8220;There&#8217;s No Write Way&#8221;!</p>\n<p><a href=\"http://evbpmusic.com/wp-content/uploads/2015/05/Theres-No-Write-Way.mp3\">There&#8217;s No Write Way</a></p>\n<p>The updates might slow down in the next week or two as I am considering retooling one of the initial instrumental arrangements for a song. I will post again as soon as possible though.</p>\n<p>Stay weird internet!</p>\n",
    "excerpt": "<p>You should feel totally special, internet. I&#8217;m spoiling the fuck out of you this week! I have not one, not two, but&#8230; oh wait. Yeah, two! Two songs titles to post this week: 3. Leaf of Forgiveness 4. Kittens and Warm Cocoa I swear the first one is not about pot! I&#8217;m actually not entirely &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/05/completed-tracks-for-m-e-o-w-part-3/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 282,
    "date": "2015-05-04T02:14:56",
    "slug": "completed-tracks-for-m-e-o-w-part-2",
    "header": "Completed Tracks for M.E.O.W. part 2",
    "body": "<p>Remember when I said last week that I would be posting a song title here each time a track was ready for mastering?</p>\n<p>No? Well then, read <a title=\"the previous post\" href=\"http://evbpmusic.com/?p=278\">the previous post</a>! As for those of you who have been following the news posts on this site &#8211; thank you for your interest in what I do with stuff on the internet! The second completed track is</p>\n<p><code>There's No Write Way</code></p>\n<p>This will be the lead-off track on the album and I&#8217;m sure you will all enjoy it a lot. Even by my standards, it&#8217;s fucking weird!</p>\n<p>In other news, I am getting my studio back up and running. And you know what that means for you, right? Yes! More weird, wild, and what-the-fudge songs from yours truly! At this point I&#8217;m being very particular about what winds up on my next &#8220;official&#8221; record. And by my next record, I don&#8217;t mean the one you guys have been waiting nearly 3 years for &#8211; nope, I&#8217;m looking to the future! With that pickiness in mind, it is likely I will release some singles, EPs, things, etc just to get the creative impulses out of my system while I work towards my NEXT record!</p>\n<p>Stay tuned! The name of the third track drops next week! And if you&#8217;re lucky, you might just get a preview of one of the new tracks!</p>\n",
    "excerpt": "<p>Remember when I said last week that I would be posting a song title here each time a track was ready for mastering? No? Well then, read the previous post! As for those of you who have been following the news posts on this site &#8211; thank you for your interest in what I do &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/05/completed-tracks-for-m-e-o-w-part-2/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 278,
    "date": "2015-04-27T02:47:44",
    "slug": "motivation-drops-the-bass",
    "header": "Motivation Drops The Bass",
    "body": "<p>&#8230;which means&#8230; what?</p>\n<p>it means that in order to push myself to Finish mixing <em>the mechanical essence Of whiskers</em>, i will post a Song title from the album on the news feed the day it is ready for mastering. there are ten trackS in all. and here is the first one to cross the fInish Line:</p>\n<p><code>candytosis (sweet tooth 2)</code></p>\n<p>In oTher nEws, i have moved Closer to my place of work near ann arbor, michigan whicH has a vibrant (and strange) music scene. I hope to make a mark here and perhapS in nearby detroit. and bowLing green, ohio &#8211; i miss you guYs and gals! </p>\n<p>but first Things first &#8211; finishing the record. i have other ideas in my head that are sitting on the backburner that I am eager to start makiNg some proGress onT. and i wOuld feel guiltY moving On to these newer ideas before the albUm was done.</p>\n<p>i couldn&#8217;t resist giving you guys a riddle to unravel. keep an eye out for my <strong>#N_E_X_T</strong> post!</p>\n",
    "excerpt": "<p>&#8230;which means&#8230; what? it means that in order to push myself to Finish mixing the mechanical essence Of whiskers, i will post a Song title from the album on the news feed the day it is ready for mastering. there are ten trackS in all. and here is the first one to cross the fInish &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2015/04/motivation-drops-the-bass/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 270,
    "date": "2014-06-22T16:36:09",
    "slug": "the-new-album-life-stuff",
    "header": "The New Album, Life &#038; Stuff",
    "body": "<p>Hey friends! It&#8217;s been a while.</p>\n<p>So I feel the need to apologize to everyone for the long delay in the completion of <strong>M.E.O.W.</strong> I also feel the need to explain to you all why the album is taking so long to get into your hot little hands.</p>\n<p>Back in April of last year I lost my day job. I spent the next 4 months unemployed, and trying to find work. Having spent over 13 years of my life in retail, I really tried hard to put my degree to good use and get out of that rat race.</p>\n<p>Well, I succeeded. I have a full time job at an awesome company in Ann Arbor, MI. And I&#8217;m doing something I love. I write code! I wake up each morning and look forward to my work day, and that is something I never thought I would get to say.</p>\n<p>Unfortunately, the rock &amp; roll lifestyle tends to clash with the day job lifestyle &#8211; especially when you live an hour away from work and an hour away from most venues.</p>\n<p>Since I last updated the website, I&#8217;ve done a few small open mic nights but haven&#8217;t really done anything big. I almost had a gig with the guys in Tri-Nebulous back in March. Unfortunately, it fell through when the venue underwent a management change and decided they didn&#8217;t want to put on rock shows anymore. It happens.</p>\n<p>So I&#8217;ve had some difficulty finding the time to book and play gigs. I promise to get back to it real soon &#8211; I love being on stage!</p>\n<p>Now about the album. <strong></strong>Obviously the day job eats up time that could be spent mixing the album. But I&#8217;ve also suffered the same thing that a lot of independent artists suffer from &#8211; perfectionism. I want every note, every song, and every mix to match what I hear in my head.</p>\n<p>This record is the first one where I really feel totally in control of the quality of the product &#8211; from start to finish. Being an independent artist also means you have no one else to blame if you&#8217;re unhappy with something you release to the public. I want you guys to get the best record I can give you.</p>\n<p>With that in mind, I have completed the first phase of mixing and am going in to the studio in the next week or two to fine tune those mixes. I hope to have the record ready to go to mastering by the end of July.</p>\n<p>In the meantime, I have a few surprises coming your way and I hope they will more than make up for my long absence.</p>\n<p>So, until next time &#8211; stay weird!</p>\n<p>&#8211; Experimental Voice Box Programmer</p>\n",
    "excerpt": "<p>Hey friends! It&#8217;s been a while. So I feel the need to apologize to everyone for the long delay in the completion of M.E.O.W. I also feel the need to explain to you all why the album is taking so long to get into your hot little hands. Back in April of last year I &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2014/06/the-new-album-life-stuff/\">Continue reading</a></p>\n",
    "metaTags": []
  },
  {
    "id": 248,
    "date": "2013-07-11T23:56:56",
    "slug": "welcome-to-evbpmusic-com-v3-0",
    "header": "Welcome to evbpmusic.com v3.0",
    "body": "<p>Welcome to the new version of the website! </p>\n<p>The sexy new design is meant to complement the sexy new album <em>The Mechanical Essence Of Whiskers</em>. Nine of ten songs have reached the final mix stage and are waiting to be mastered. The final track &#8220;Decipher This Song&#8221; is getting some last minute retooling before getting mixed. I want it to be perfect. After all, it&#8217;s not everyday that <a href=\"http://mclars.com\" title=\"MC Lars\">MC Lars</a> graces one of my tracks.</p>\n<p>Speaking of Lars, he is currently on tour with the traveling freak show known as <a href=\"http://vanswarpedtour.com\" title=\"Warped Tour 2013\">Warped Tour 2013!</a> So you should get yourself a ticket and head out and see that! </p>\n<p>I have decided that because of the magnitude of the album that is to follow <em>M.E.O.W.</em>, I will be releasing an as of yet untitled EP. Comprised of a combination of unreleased tracks, cover tunes, remixes, and live tracks it should at the very least tide you over until <em>NEXT</em> is ready.</p>\n<p>So that&#8217;s all for now. Take a look around and enjoy the new site!</p>\n<p>Stay Weird. </p>\n",
    "excerpt": "<p>Welcome to the new version of the website! The sexy new design is meant to complement the sexy new album The Mechanical Essence Of Whiskers. Nine of ten songs have reached the final mix stage and are waiting to be mastered. The final track &#8220;Decipher This Song&#8221; is getting some last minute retooling before getting &hellip; </p>\n<p><a class=\"more-link btn\" href=\"https://evbpmusic.com/2013/07/welcome-to-evbpmusic-com-v3-0/\">Continue reading</a></p>\n",
    "metaTags": []
  }
]
