{
  "EVBPRelatedLinks": [
    {
      "content": "Long ago, I spent a lot of time on this site, but then infinite scrolling (among other things) got the best of me. I don&apos;t really use <a href=\"https://www.facebook.com/experimentalvoiceboxprogrammer\" target=\"_blank\">Facebook</a> anymore, but it exists never the less.",
      "name": "facebook"
    },
    {
      "content": "Good riddance to <strong>Twitter/X</strong>. It was starting to go the way of FB, then Musk took over and decided to ramp up the edge-lord garbage even more. My new social of choice is <a href=\"https://bsky.app/profile/evbp.bsky.social\" target=\"_blank\">BlueSky</a>.",
      "name": "bluesky"
    },
    {
      "content": "Did you know I make stuff other than music? It&apos;s true! While I&apos;m no James Cameron, I have made a few music videos of varying quality (and absurdity) and posted them on the <a href=\"https://www.youtube.com/@therealevbp\" target=\"_blank\">YouTubes</a>, so I might be an Anton Corbijn at least.",
      "name": "youtube"
    },
    {
      "content": "It goes without saying that you should check out my <a href=\"https://evbp.bandcamp.com/\" target=\"_blank\">bandcamp page</a>. Where else on the internet can you get free EVBP music? Pirate Bay? Psssh, as if.",
      "name": "bandcamp"
    },
    {
      "content": "My step-father <a href=\"https://abovepetesgarage.com/\" target=\"_blank\">Pete Bishop</a> has helped mix, master and produce not just my recordings, but hundreds, if not thousands of other people&apos;s recordings over the years. Heck, he&apos;s practically a member of my band at this point.",
      "name": "above-petes-garage"
    },
    {
      "content": "My pal Jordan Schug plays cello covers of old school NES tunes <a href=\"https://www.twitch.tv/nescello\" target=\"_blank\">over on Twitch</a>, and he also play cello at <a href=\"https://jordanschug.com/\" target=\"_blank\">your wedding</a> if you have one of those.",
      "name": "jordan-schug"
    },
    {
      "content": "Adam Boose at <a href=\"https://www.caulifloweraudio.com/\" target=\"_blank\">Cauliflower Audio</a> subjected his ears to the most unpleasant frequencies known to man just to make <span>The Mechanical Essence of Whiskers</span> enjoyable for your ears. You should probably thank him.",
      "name": "cauliflower-audio"
    },
    {
      "content": "Logan Witte, AKA <a href=\"https://innocentvigilantordinary.bandcamp.com/album/this-empty-house-that-once-was-home-2\" target=\"_blank\">Innocent Vigilant Ordinary</a> plays a helluva drum kit on my track &quot;Pixel Fix&quot;, but he&apos;s also one of those artists who writes the kind of deeply emotional songs that make you envious of his skills.",
      "name": "innocent-vigilant-ordinary"
    },
    {
      "content": "<a href=\"https://www.facebook.com/JesusPlaysGuitar/\" target=\"_blank\">Jesus Sanchez</a> is one of the many talented musicians to contribute to my seminal (inconsequential perhaps?) album MEOW. His band Tri-Nebulous is one of the few progressive rock groups that I like. Sorry Tool fans.",
      "name": "jesus-sanchez"
    },
    {
      "content": "Not music related, but my fiance makes very, very pretty jewelry, custom wood working, and all kinds of other things as <a href=\"https://www.etsy.com/shop/seluascustomcrafts/\" target=\"_blank\">Selua&apos;s Custom Crafts</a> in addition to being a scary good data engineer.",
      "name": "seluas-custom-crafts"
    },
    {
      "content": "<a href=\"https://mclars.com/\" target=\"_blank\">MC Lars</a> is just the nicest guy you have ever met. He added some lit-hop flavor to my track &quot;Decipher This Song.&quot; Definitely check him out.",
      "name": "mc-lars"
    },
    {
      "content": "Tony Raines has a band called <a href=\"https://www.facebook.com/ruinyourlife/\" target=\"_blank\">Ruin Your Life</a>, and it is a jolly good time. Punk rock at its finest.",
      "name": "ruin-your-life-band"
    }
  ],
  "NonEVBPRelatedLinks": [
    {
      "content": "Some web comics age poorly. And some web comics age like <a href=\"https://somethingpositive.net/\" target=\"_blank\">Something Positive</a> - the author may get crankier, but he&apos; still right.",
      "name": "something-positive"
    },
    {
      "content": "In the era of guitar amp simulators, I find nothing more frustrating than trying to get a configuration that sounds good and is actually inspiring. <a href=\"https://www.polychromedsp.com/\" target=\"_blank\">Polychrome DSP</a>, and the <a href=\"https://www.polychromedsp.com/mcrocklin-suite/\" target=\"_blank\">McRocklin Suite</a> does a pretty good job of that.",
      "name": "polychrome-dsp"
    },
    {
      "content": "You ever find one of those bands where you are unable to explain why you love their music, but you still do? Yeah. That would be <a href=\"https://www.hiroshimamusic.com/\" target=\"_blank\">Hiroshima</a> for me.",
      "name": "hiroshima-band"
    },
    {
      "content": "Even if you can&apos;t remember where, you have probably seen <a href=\"https://www.dailykos.com/blogs/Tom%20Tomorrow\" target=\"_blank\">Tom</a> <a href=\"https://thismodernworld.com/\" target=\"_blank\">Tomorrow</a>&apos;s satirical (and more often than not, political) comics out here in the real world. Always a good sanity check.",
      "name": "tom-tomorrow"
    },
    {
      "content": "It is ALWAYS a good idea to keep tabs on your local politician and find out who they are receiving money from. <a href=\"https://www.opensecrets.org/\" target=\"_blank\">Open Secrets</a> makes it easier than ever.",
      "name": "open-secrets"
    },
    {
      "content": "My only major hang up with <a href=\"https://www.amnesty.org/en/\" target=\"_blank\">Amnesty International</a> is that they ask for donations far too often for my taste. But the work they do is solid, so it doesn&apos;t bother me too much.",
      "name": "amnesty-international"
    },
    {
      "content": "Support your local bookstore! Mine is <a href=\"https://literatibookstore.com/\" target=\"_blank\">Literati</a>.",
      "name": "literati-bookstore"
    },
    {
      "content": "Also support your local record store! My personal favorites are <a href=\"https://dearbornmusic.net/\" target=\"_blank\">Dearborn Music</a>, <a href=\"https://wazoorecords.blogspot.com/\" target=\"_blank\">Wazoo</a>, <a href=\"https://encorerecordsa2.com/\" target=\"_blank\">Encore</a>, <a href=\"https://uhfrecords.com/\" target=\"_blank\">UHF</a>, and <a href=\"https://ugsounds.com/\" target=\"_blank\">Underground Sounds</a>.",
      "name": "local-record-stores-southeast-michigan"
    },
    {
      "content": "I am a big fan of YouTuber <a href=\"https://www.youtube.com/caelanconrad\" target=\"_blank\">Caelan Conrad</a>&apos;s video essays. Always informative with just the right amount of humor.",
      "name": "caelan-conrad"
    },
    {
      "content": "Speaking of Caelan, I would be highly embarrassed to not mention the YouTuber that introduced me to them, <a href=\"https://www.youtube.com/thoughtslime\" target=\"_blank\">Thought Slime</a>.",
      "name": "thought-slime"
    },
    {
      "content": "Need to spend money on some music equipment? You can&apos;t go wrong with <a href=\"https://www.sweetwater.com/\" target=\"_blank\">Sweetwater</a>. Or if you are on a budget, there is always <a href=\"https://musicgoround.com/locations/ann-arbor-mi/\" target=\"_blank\">Music Go Round</a>.",
      "name": "sweetwater"
    },
    {
      "content": "Back when I first started working as a software dev in Ann Arbor, my co-workers introduced me to the joy that is <a href=\"https://nothai.com/\" target=\"_blank\">No Thai</a>. My life hasn&apos;s been the same since.",
      "name": "no-thai-restaurant"
    },
    {
      "content": "Speaking of my software dev co-workers, when the market took a hit a few years ago, one of them helped get <a href=\"https://www.ahabiryanis.com/\" target=\"_blank\">Aha Bhiryanis</a> off the ground, and they are now my favorite Indian restaurant.",
      "name": "aha-bhiryanis-restaurant"
    },
    {
      "content": "Sure, there are plenty of add-ons for Chrome to <a href=\"https://www.tomshardware.com/how-to/block-google-ai-overviews\" target=\"_blank\">hide the AI garbage</a> at the top of the page, but there&apos;s also a way to <a href=\"https://www.reddit.com/r/techsupport/comments/1h9jpqs/comment/m7j9n8m/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button\" target=\"_blank\">disable it entirely</a> as well. <em>Just a slight heads up, you will likely need to go in and replace &quot;google.baseURL&quot; with www.google.com each time you restart your browser</em>, which is annoying but still a heck of a lot better than AI overviews that can&apos;t even get the date right.",
      "name": "no-ai-google-chrome"
    },
    {
      "content": "I tried them back when I was a teenager because they were described as being a punk rock band, but I was sorely disappointed by the lack of power chords and overly fast, snotty anthems. As an adult, I have finally grown into this pair of shoes, and they are some of the comfiest I have. <a href=\"https://www.bunnymen.com/\" target=\"_blank\">Echo & the Bunnymen</a>.",
      "name": "echo-and-the-bunnymen-band"
    },
    {
      "content": "If you are in the software dev practice, it is your professional responsibility to challenge yourself daily. <a href=\"https://www.hackerrank.com/\" target=\"_blank\">HackerRank</a> is here to help.",
      "name": "hacker-rank"
    },
    {
      "content": "Speaking of software development, <a href=\"https://www.jetbrains.com/webstorm/\" target=\"_blank\">WebStorm</a> is a better IDE than VSCode in nearly every sense. Don&apos;t at me.",
      "name": "webstorm-ide"
    }
  ]
}
